import React from 'react';

const Menu2_Child1_Content3 = () => {
    return (
        <>
            <p><b>Кортеждер</b></p>
            <p>Кортеждер  тізімгі ұқсас, бірақ біз оны тік жақшамен емес дөңес жақшамен құрамыз. Кортежді құруға арналған тұрақты арқылы да кортеж құруға болады. Тізім мен кортеждің тағы бір айырмашылығы кортеж өзгемейді ал тізім өзгереді. Мысалдар келтіріп көрейік:</p>
            <p>{'>>>'} my_tuple=(1,2,3,4,5)</p>
            <p>{'>>>'} a = my_tuple[0:3]</p>
            <p>{'>>>'} print(a)</p>
            <p><b>Output</b></p>
            <p>(1, 2, 3)</p>
            <p>{'>>>'} another_tuple = tuple()</p>
            <p>{'>>>'} abc=tuple([1,2,3])</p>
            <p>{'>>>'} print(abc)</p>
            <p><b>Output</b></p>
            <p>(1, 2, 3)</p>
            <p>Берілген код бес элементтен тұратын кортежді құрады. Және де кортеж элементтерін бөліктеп алуға болады,бірақ сорттай алмаймыз. Екінші мысалда tuple() кілт сөзі арқылы кортеж құрдық. Abc кортежі үш элементтен тұрады. Кортеж тізімнен құралған. Бұл конверттеу болып табылады. Яғни тізімді кортежге конверттеу. Және кері жағдайда кортежді тізімге конверттегіміз келсе ол төмендегідей болады:</p>
            <p>{'>>>'} abc_list = list(abc)</p>
            <p>{'>>>'} print(abc)</p>
            <p><b>Output</b></p>
            <p>(1, 2, 3)</p>
            <div><b>Пайдаланылған әдебиеттер тізімі</b></div>
            <ol>
                <li>Билл Любанович, Простой Python. Современный стиль программирования, екінші шығарылым,Санк – Петербург,2021.- 531 – 539 стр.</li>
                <li>Python 3 для начинающих <a href='https://pythonworld.ru/samouchitel-python'>https://pythonworld.ru/samouchitel-python</a></li>
            </ol>
        </>
    )
}

export default Menu2_Child1_Content3;