import React from 'react';
import Menu1_Child3_Content2_Image1 from '../assets/images/Menu1_Child3_Content2_Image1.png';
const Menu1_Child3_Content2 = () => {
    return (
        <>
            <p><b>Меншіктеу, бірнеше есімдерді меншіктеу</b></p>
            <b>Жоспар:</b>
            <ol>
                <li>Меншіктеу</li>
                <li>Бірнеше есімдерді меншіктеу</li>
            </ol>
            <p>Python тілінде (=) теңдік белгісі меншіктеу операторы болып табылады. Теңдік белгісінің қолданылу шарты математикадағыдай емес. Оған мысал келтірер болсақ: y = x +5</p>
            <p>математика тілімен бұл теңдеу деп саналса, Python тілінде y айнымалысы x + 5 мәнін меншіктейді дегенді білдіреді. Демек Python тілінде теңдеу осы түрде шешіледі</p>
            <p>{'>>>'} x=5</p>
            <p>{'>>>'} y=x+5</p>
            <p>{'>>>'} y</p>
            <p>{'>>>'} 10</p>
            <p>Математика тілінде y мәнінің x+5 мәніне тең екенін білдірсе бағдарламалау тілімен ол оң жақтағы мән сол жақтағы мәнді өзіне меншіктейтіндігін көрсетеді.Python  тілінде компьютердің y=x+5 теңдеуін орындау ретін әр деңгейге бөліп жазар болсақ:</p>
            <ul>
                <li>ортадағы (=) теңдік белгісін көреді</li>
                <li>меншіктеу операторы екендігін түсінеді</li>
                <li>оң жақтағы мәнді есептейді(x айнымалысы сілтенетін объекті мәнін қабылдайды және оған 5 литералын қосады)</li>
                <li>алынған мәнді y айнымалысына меншіктейді</li>
            </ul>
            <p>Дәл осылай сіздерде өз компьютеріңізден cmd (сурет 1)ашып және ең алдымен python деп жазу арқылы python тілін іске қосып, жоғарыдағы секілді меншіктеу операторына мысалдар келтіріп көрсеңіздер болады.</p>
            <div>
                <img src={Menu1_Child3_Content2_Image1} alter={'Menu1_Child1_Content1_Image1.png'}/>
                Сурет 1
            </div>
            <p>Python-да айнымалылар туралы тағы бір айта кететін жағдай ол: айнымалылар тек атаулар болып табылады, және бұл Python мен басқа бағдарламалау тілдерінің арасындағы айырмашылық. Мұны есте ұстаған жөн, әсіресе тізімдер сияқты өзгеретін нысандармен жұмыс жасау кезінде. Меншіктеу операциясы мәнді көшірмейді, тек қажетті деректерді қамтитын объектіге атау береді. Атау-бұл объектінің өзі емес, объектіге сілтеме. Атау-бұл компьютердің жадында бір жерде орналасқан объектімен қорапқа желімделген затбелгі деп елестетуге болады.</p>
            <p><b>Бірнеше есімдерді меншіктеу</b></p>
            <p>Бір мәнді бірнеше айнымалыға меншіктеуге болады. Мысалы:</p>
            <p>{'>>>'} a = b = c = 4</p>
            <p>{'>>>'} a</p>
            <p>{'>>>'} 4</p>
            <p>{'>>>'} b</p>
            <p>{'>>>'} 4</p>
            <div><b>Пайдаланылған әдебиеттер тізімі</b></div>
            <ol>
                <li>Билл Любанович, Простой Python. Современный стиль программирования, екінші шығарылым,Санк – Петербург,2021.- 531 – 539 стр.</li>
                <li>Python 3 для начинающих <a href='https://pythonworld.ru/samouchitel-python'>https://pythonworld.ru/samouchitel-python</a></li>
            </ol>
        </>
    )
}

export default Menu1_Child3_Content2;