import React from 'react';

const Menu1_Child5_Content1 = () => {
    return (
        <>
            <p><b>Тырнақша көмегімен жолдарды құру</b></p>
            <b>Жоспар:</b>
            <ol>
                <li>Бірлік тырнақшаны қолдану</li>
                <li>Үш тырнақша көмегімен көпқатарлы жолдарды құру</li>
            </ol>
            <p>Python тіліндегі жолдар – символдардың реттелген тізбегі. Жолдар тексттік мәліметтерді сақтауға және бейнелеуге қолданылады.</p>
            <p>Python – да мәтін жолдарын құру үшін бірлік немесе екілік тырнақшалар қолданылады. Мысалы:</p>
            <p>{'>>>'} 'Python'</p>
            <p>'Python'</p>
            <p>{'>>>'} "Python"</p>
            <p>'Python'</p>
            <p>Интерпретатор арқылы ол бірлік тырнақша шығады. Бірақ екеуіде бір мағынаны білдіреді. Бірлік тырнақша ішіне екілік тырнақшаны қолданып жолдармен жұмыс жасаса болады немесе кері жағдайда да қателік тудырмайды оған төмендегі мысал дәлел:</p>
            <p>{'>>>'} ' "Python is the best programming language" '</p>
            <p>' "Python is the best programming language" '</p>
            <p>{'>>>'} " 'Python is the best programming language' "</p>
            <p>" 'Python is the best programming language' "</p>
            <p>Үш бірлік тырнақша көмегімен немесе үш екілік тырнақша көмегімен де жолдармен жұмыс жасаса болады. Мысалы:</p>
            <p>{'>>>'} '''Python'''</p>
            <p>'Python'</p>
            <p>{'>>>'} """Python"""</p>
            <p>'Python'</p>
            <p>Үш тырнақшаны қатар қолдану көбінесе көпқатарлы қатарлармен жұмыс жасағанда қажет болады.Мысалы төмендегі мақалды үш тыранақша көмегімен шығарсақ:</p>
            <p>{'>>>'} '''Қыз өссе елдің көркі, </p>
            <p>... Гүл өссе жердің көркі.'''</p>
            <p>'Қыз өссе елдің көркі,\nГүл өссе жердің көркі.'</p>
            <p>Ескере кететін жағдай үш бірдей тырнақша көмегімен көпқатарлы мәтін жолдарын жай ғана экранға шығарсақ барлық жолдарды бір қатарға шығарады ал егер  print() функциясы көмегімен шығарсақ, төмендегідей экранға шығады.Мысалы:</p>
            <p>{'>>>'} poem = ''' Қыз өссе елдің көркі,</p>
            <p>... Гүл өссе жердің көркі.'''</p>
            <p>{'>>>'} print(poem)</p>
            <p>Қыз өссе елдің көркі,</p>
            <p>Гүл өссе жердің көркі.</p>
            <p>Бірлік жақша көмегімен де екілік жақша көмегімен де бос қатарлармен жұмыс жасаса болады. </p>
            <p>Мысалы:</p>
            <p>{'>>>'} ' '</p>
            <p>' '</p>
            <p>{'>>>'} " "</p>
            <p>' '</p>
            <p>{'>>>'} ''' '''</p>
            <p>' '</p>
            <p>{'>>>'} """ """</p>
            <p>'  '</p>
            <p>Осы тұрғыда не себепті бос қатарларды қолдану бізге не үшін қажет болады деген сұрақ туындауы мүмкін. Кейбір жағдайларда екі мәтін жолдарынан тұратын қатарларда бір қатарға шығару қажет болады.Мысалы:</p>
            <p>{'>>>'} bottles = 99</p>
            <p>{'>>>'} base =' '</p>
            <p>{'>>>'} base+='current inventory:'</p>
            <p>{'>>>'} base+=str(bottles)</p>
            <p>{'>>>'} base</p>
            <p>'current inventory:99'</p>
            <div><b>Пайдаланылған әдебиеттер тізімі</b></div>
            <ol>
                <li>Билл Любанович, Простой Python. Современный стиль программирования, екінші шығарылым,Санк – Петербург,2021.- 531 – 539 стр.</li>
                <li>Python 3 для начинающих <a href='https://pythonworld.ru/samouchitel-python'>https://pythonworld.ru/samouchitel-python</a></li>
            </ol>
        </>
    )
}

export default Menu1_Child5_Content1;