import React from 'react';

const Menu1_Child4_Content1 = () => {
    return (
        <>
            <p><b>Бүтін сандар, нақты сандар, логикалық мәндер,математикалық операциялар</b></p>
            <b>Жоспар:</b>
            <ol>
                <li>Бүтін және нақты сандарға қолданылатын негізгі амалдар</li>
                <li>Логикалық мәндер</li>
            </ol>
            <p>Бүтін санды нақты санға немесе нақты санды бүтін санға айналдыру үшін арнайы функциялар қолданылады. Олар: int() және float(). Мысалға int(3.14) функциясы 3 санын қайтарады, ал float(4) функциясы 4.0 мәнін қайтарады. Сандарға қоладнылатын негізгі амалдар 1 – ші кестеде көрсетіледі.</p>
            <table>
                <tr><td><b>Амалдар</b></td><td><b>Сипаттамасы</b></td></tr>
                <tr><td>a+b</td><td>қосу</td></tr>
                <tr><td>a-b</td><td>алу</td></tr>
                <tr><td>a*b</td><td>көбейту</td></tr>
                <tr><td>a/b</td><td>Бөлу: егер екі айнымалыда бүтін болса, бөлінді бүтін, ал егер біреуі нақты сан болса, нақты сан қайтарады</td></tr>
                <tr><td>a//b</td><td>Бүтін мәнді бөлу(екі санда нақты сандар болса бөлшек бөлігі нөлге тең нақты санды береді) Мысалы: <p>100//8 → 12</p><p>101.8//12.5 → 8.0</p></td></tr>
                <tr><td>a%b</td><td>a – ны b – ға бөлгендегі қалдық, мысалы: 100%8 → 4</td></tr>
                <tr><td>a**b</td><td>Дәрежелеу (a-ның b дәрежесі).Нақты сандар үшін де орындалады. Мысалы: <p>2**4</p><p>1.9**(-2.5) → 0.20096295016897833</p></td></tr>
                <tr><td>-a</td><td>Санның таңбасын ауыстыру үшін қолданылады</td></tr>
                <tr><td>abs(a)</td><td>а санының  модулі мысалы abs((-4) → 4)</td></tr>
                <tr><td>pow(a,b,[c])</td><td>а ның b дәрежесі (модуль бойынша)</td></tr>
                <tr><td>int([object],[санау жүйесі негізі])</td><td>Бүтін санға түрлендіру(ондық санау жүйесінде немесе негізін беруге болады)</td></tr>
                <tr><td>bin(a)</td><td>Бүтін санды екілік жолға түрлендіру</td></tr>
                <tr><td>hex(a)</td><td>Бүтін санды оналтылық жолға түрлендіру</td></tr>
                <tr><td>oct(a)</td><td>Бүтін санды сегіздік жолға түрлендіру</td></tr>
                <tr><td>pow()</td><td>Дәрежелеу, мысалы pow(2,3) → 8</td></tr>
                <tr><td>divmod()</td><td>Бүтін мәнді бөлу мәні мен қалдығын есептеу, мысалы:divmod((19,5) → (3,4))</td></tr>
                <tr><td>round()</td><td>Математикалық дөңгелектеу, мысалы round((100.0/6) → 17.0)</td></tr>
            </table>
            <p>Мысалы:</p>
            <p>{'>>>'} a=int('19')</p>
            <p>{'>>>'} c=int(19.5)</p>
            <p>{'>>>'} print(a,c)</p>
            <p>19 19</p>
            <p>{'>>>'} bin(5)</p>
            <p>'0b101'</p>
            <p>{'>>>'} oct(5)</p>
            <p>'0o5'</p>
            <p>{'>>>'} hex(5)</p>
            <p>'0x5'</p>
            <p>{'>>>'} int('101',2)</p>
            <p>5</p>
            <p>{'>>>'} int('0b101',2)</p>
            <p>5</p>
            <p><b>Логикалық мәндер</b></p>
            <p>Python тілінде логикалық мәндер екі тұрақты шамамен беріледі яғни олар мыналар: True(Ақиқат) False(Жалған). Логикалық амалдар мен есептеулер нәтижесі логикалық мәнді беретіні белгілі(кесте 2).</p>
            <table>
                <tr><td><b>Амалдар</b></td><td><b>Сипаттамасы</b></td></tr>
                <tr><td>{'>'}</td><td>үлкен(мысалы a{'>'}b)</td></tr>
                <tr><td>{'<'}</td><td>кіші(мысалы a{'<'}b)</td></tr>
                <tr><td>==</td><td>тең</td></tr>
                <tr><td>!=</td><td>Тең емес</td></tr>
                <tr><td>not x</td><td>Терістеу, жоққа шығару</td></tr>
                <tr><td>x and y</td><td>Логикалық «және»</td></tr>
                <tr><td>x or y</td><td>Логикалық «немесе»</td></tr>
                <tr><td>x in A</td><td>Жиынға тиістілігі</td></tr>
                <tr><td>a{'<'}x{'<'}b</td><td>(x{'>'}a) and (x{'<'}b) құрама шартына эквивалентті</td></tr>
            </table>
            <div><b>Пайдаланылған әдебиеттер тізімі</b></div>
            <ol>
                <li>Билл Любанович, Простой Python. Современный стиль программирования, екінші шығарылым,Санк – Петербург,2021.- 531 – 539 стр.</li>
                <li>Python 3 для начинающих <a href='https://pythonworld.ru/samouchitel-python'>https://pythonworld.ru/samouchitel-python</a></li>
                <li>Байбактина А.Т. Python – да қосымшаларды құру:дәрістер жинағы/ А.Т.Байбактина. – Алматы: New book, 2021. -144 б.</li>
            </ol>
        </>
    )
}

export default Menu1_Child4_Content1;