import React from 'react';

const Menu2_Child1_Content2 = () => {
    return (
        <>
            <p><b>Сөздіктер</b></p>
            <p>Python сөздігі – ретсіз өзгертілетін коллекция немесе, қарапайым айтқанда, өзгермейтін түрдегі ерікті кілттері бар “тізім”</p>
            <p>Python сөздігі көп жағдайда хэш-кесте болып табылады. Кейбір тілдерде сөздіктерді ассоциативті жад немесе ассоциативті массивтер деп атауға болады. Олар кез-келген өзгермейтін типтегі болуы мүмкін кілттермен индекстеледі. Мысалы, жол немесе сан кілт болуы мүмкін. Сөздіктің кілт жұптарының реттелмеген жиынтығы екенін есте ұстаған жөн:мағынасы және кілттері ерекше болуы керек.</p>
            <p>Кілттердің тізімін белгілі бір сөздікте keys() әдісін шақыру арқылы алуға болады. Кілт сөздікте бар-жоғын тексеру үшін Python-да in кілтін пайдалануға болады.</p>
            <p>{'>>>'} my_dict = {}</p>
            <p>{'>>>'} another_dict = dict()</p>
            <p>{'>>>'} my_other_dict = {'{"one":1,"two":2,"three":3}'}</p>
            <p>{'>>>'} print(my_other_dict)</p>
            <p><b>Output</b></p>
            <p>{"{'one': 1, 'two': 2, 'three': 3}"}</p>
            <p>Алғашқы екі мысал бос сөздіктерді құруды көрсетеді.  Сөздіктер фигуралы жақшада болады. Енді сөздіктегі мағыналардың қалай қабылданатынын білетін уақыт келді.</p>
            <p>{'>>>'} my_other_dict = {'{"one":1,"two":2,"three":3}'}</p>
            <p>{'>>>'} print(my_other_dict["one"])</p>
            <p><b>Output</b></p>
            <p>1</p>
            <p>{'>>>'} my_dict={'{"name":"Mike","address":"123 Happy Way"}'}</p>
            <p>{'>>>'} print(my_dict["name"])</p>
            <p><b>Output</b></p>
            <p>Mike</p>
            <p>Бірінші мысалда біз алдыңғы мысалдан сөздік қолдандық және one деп аталатын кілтпен байланысты мәнді шығардық. Екінші мысал name кілтіне мәнді қалай қою керектігін көрсетеді. Енді кілттің сөздікте бар немесе жоқтығын тексеріп көрейік:</p>
            <p>{'>>>'} print("name" in my_dict)</p>
            <p>True</p>
            <p>{'>>>'} print("state" in my_dict)</p>
            <p>False</p>
            <p>Сөздіктегі кілттер тізімін экранға шығарғымыз келсе:</p>
            <p>{'>>>'} my_dict={'{"name":"Mike","address":"123 Happy Way"}'}</p>
            <p>{'>>>'} print(my_dict.keys())</p>
            <p><b>Output</b></p>
            <p>dict_keys(['name',</p>
            <p>'address'])</p>
            <div><b>Пайдаланылған әдебиеттер тізімі</b></div>
            <ol>
                <li>Билл Любанович, Простой Python. Современный стиль программирования, екінші шығарылым,Санк – Петербург,2021.- 531 – 539 стр.</li>
                <li>Python 3 для начинающих <a href='https://pythonworld.ru/samouchitel-python'>https://pythonworld.ru/samouchitel-python</a></li>
            </ol>
        </>
    )
}

export default Menu2_Child1_Content2;