import React from 'react';

const Menu1_Child5_Content2 = () => {
    return (
        <>
            <p><b>Жолдарға қолданылатын амалдар және өңдеуге арналған функциялар</b></p>
            <p>Бір қатардағы  мәтін жолдарын бірнеше қатарларға бөліп жазу үшін ( \n ) – таңбасы қолданылады. Мысалы:</p>
            <p>{'>>>'} palindrome = 'Almaty \n Astana \n Kyzylorda'</p>
            <p>{'>>>'} print(palindrome)</p>
            <p>Almaty</p>
            <p>Astana</p>
            <p>Kyzylorda</p>
            <p>Табулаяция жасау үшін (\t) – таңбасы қолданылады.Мысалы:</p>
            <p>{'>>>'} print('\tabc')</p>
            <p>abc</p>
            <p>Егер де сізге мәтін жолдары ішінде кері слэш (\) таңбасы қажет болса, онда оны екі рет жазасыз.Мысалы:</p>
            <p>{'>>>'} palindrome = 'Python is the best:\\'</p>
            <p>{'>>>'} print(palindrome)</p>
            <p>Python is the best:\</p>
            <p>Қосу (+) – таңбасы арқылы мәтін жолдарын біріктіруге болады.Мысалы:</p>
            <p>{'>>>'} 'Python' + 'is the best'</p>
            <p>'Pythonis the best'</p>
            <p>Қосу таңбасының көмегінсізде жолдарды біріктіруге болады:</p>
            <p>{'>>>'} "Python" "is the best"</p>
            'Pythonis the best'
            <p>Көбейту (*) таңбасының көмегімен мәтін жолдарын бірнеше есеге көбейтіп экранға шығаруға болады.Мысалы:</p>
            <p>{'>>>'} start = 'Na ' *4</p>
            <p>{'>>>'} print(start)</p>
            <p>Na Na Na Na</p>
            <p>Үлкен ұзындықтағы мәтін жолынан бір ғана әріпті таңдап алғымыз келсе [ ] тік жақшаны қолданамыз және сол әріптін орналасу позициясын тік жақша ішіне жазамыз. Мысалы:</p>
            <p>{'>>>'} letters = 'Python'</p>
            <p>{'>>>'} letters[0]</p>
            <p>'P'</p>
            <p>Егер де мәтін жолындағы барлық әріптерде шығарғымыз келсе: </p>
            <p>{'>>>'} letters[:]</p>
            <p>'Python'</p>
            <p>Егер қандайда бір позициядан кейнгі әріптерді шығару қажет болса:</p>
            <p>{'>>>'} letters[3:]</p>
            <p>'hon'</p>
            <p>Егер қандайда бір позицияға дейнгі әріптерді шығару қажет болса:</p>
            <p>{'>>>'} letters[:3]</p>
            <p>'Pyt'</p>
            <p>Немесе соңғы үш әріпті шығару қажет болса:</p>
            <p>{'>>>'} letters[-3:]</p>
            <p>'hon'</p>
            <p><b>Жолдарды өңдеуге арналған функциялар</b></p>
            <p><b>Str()</b> функциясының көмегімен өзге типтегі мәндерді мәтін жолдарына ауыстыруға болады. Мысалы:</p>
            <p>{'>>>'} str(98.6)</p>
            <p>'98.6'</p>
            <p>{'>>>'} str(1.0e4)</p>
            <p>'10000.0'</p>
            <p><b>Len()</b> функциясының көмегімен мәтін жолдарының ұзындығын алуға болады.Яғни мәтін жолындағы символдар санын аламыз.Мысалы:</p>
            <p>{'>>>'} letters = 'Python'</p>
            <p>{'>>>'} len(letters)</p>
            <p>6</p>
            <p>{'>>>'} empty=''</p>
            <p>{'>>>'} len(empty)</p>
            <p>0</p>
            <p><b>Join()</b> функциясының көмегімен мәтін жолдарын біріктіреміз.Мысалы:</p>
            <p>{'>>>'} letters = 'python'</p>
            <p>{'>>>'} letters_a = '.'.join(letters)</p>
            <p>{'>>>'} print(letters_a)</p>
            <p>p.y.t.h.o.n</p>
            <div><b>Пайдаланылған әдебиеттер тізімі</b></div>
            <ol>
                <li>Билл Любанович, Простой Python. Современный стиль программирования, екінші шығарылым,Санк – Петербург,2021.- 531 – 539 стр.</li>
                <li>Python 3 для начинающих <a href='https://pythonworld.ru/samouchitel-python'>https://pythonworld.ru/samouchitel-python</a></li>
            </ol>
        </>
    )
}

export default Menu1_Child5_Content2;