import React from 'react';

const Menu2_Child1_Content1 = () => {
    return (
        <>
        <p><b>Тізімдер</b></p>
        <p><b>Әдістемелік нұсқау</b></p>
        <p>Python  тілінде тізім деп әртүрлі типті обьектілерді сақтауға арналған реттелген мәліметтер құрылымын атайды.Тізімдер басқа программалау тіліндегі массив типіне ұқсас болып келеді, тек әртүрлі типті мәліметтерді сақтауға арналған. Тізім өлшемін өзгертуге болады.</p>
        <br></br>
        <p><b>Құру және толтыру</b></p>
        <p>Python – да тізімдер өзге бағдарламалау тіліндегі массив секілді. Бос тізім python – да төмендегідей құрылады:</p>
        <p>{'>>>'} my_list = []</p>
        <p>{'>>>'} my_list1 = list()</p>
        <p>Көріп тұрғандарыңыздай тізімді тік жақшалар арқылы да, python – ның тұрақты инструменті list() көмегімен де құруға болады. Тізімдер жолдардан,  цифрлардан, объектілерден, және бірнеше типтегі мәндерден тұрады. Бірнеше мысал келтіріп көрейік:</p>
        <p>{'>>>'} my_list = [1,2,3]</p>
        <p>{'>>>'} my_list1=["a","b","c"]</p>
        <p>{'>>>'} my_list2=["a",1,"Python",5]</p>
        <p>Бірінші тізім сандардан, екінші тізім жолдардан, үшінші тізім араласқан типтерден құралған. Және де тізімдереден тұратын тізім де құруға болады:</p>
        <p>{'>>>'} my_nested_list=[my_list,my_list1]</p>
        <p>{'>>>'} print(my_nested_list)</p>
        <p><b>Output</b></p>
        <br></br>
        <p>[[1, 2, 3], ['a', 'b', 'c']] </p>
        <p><b>Тізімді кеңейту</b></p>
        <p>Егер де екі бөлек тізімнің мәндерін бір тізімге шығарғыңыз келсе:</p>
        <p>{'>>>'} combo_list=[1]</p>
        <p>{'>>>'} one_list=[4,5]</p>
        <p>{'>>>'} a =combo_list+one_list</p>
        <p>{'>>>'} print(a)</p>
        <p><b>Output</b></p>
        <p>[1, 4, 5]</p>
        <br></br>
        <p>Сұрыптау</p>
        <p>Тізімдерді белгілі бір ретпен сұрыптау да болады:</p>
        <p>{'>>>'} alpha_list = [34,23,67,100,88,2]</p>
        <p>{'>>>'} alpha_list.sort()</p>
        <p>{'>>>'} print(alpha_list)</p>
        <p><b>Output</b></p>
        <p>[2, 23, 34, 67, 88, 100]</p>
        <br></br>
        <p><b>Тізім ішінен бір ғана элементті алу</b></p>
        <p>Тізім ішінен белгілі бір мәндерді ғана экранға шығарғымыз келсе:</p>
        <p>{'>>>'} b = alpha_list[0:3]</p>
        <p>{'>>>'} print(b)</p>
        <p><b>Output</b></p>
        <p>[2, 23, 34]</p>
        <div><b>Пайдаланылған әдебиеттер тізімі</b></div>
        <ol>
            <li>Билл Любанович, Простой Python. Современный стиль программирования, екінші шығарылым,Санк – Петербург,2021.- 531 – 539 стр.</li>
            <li>Python 3 для начинающих <a href='https://pythonworld.ru/samouchitel-python'>https://pythonworld.ru/samouchitel-python</a></li>
        </ol>
        </>
    )
}

export default Menu2_Child1_Content1;